<a href="https://colab.research.google.com/github/carolvieirav/Labs/blob/master/importing_and_exporting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 2 - Working with JSON files

Import the pandas library.

In [0]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [0]:
# your code here
nasa = pd.read_json('/nasa.json')

Now that we have loaded the data, let's examine it using the `head()` function.

In [0]:
# your code her
nasa.head()

   :@computed_region_cbhk_fwbd  ...                     year
0                          NaN  ...  1880-01-01T00:00:00.000
1                          NaN  ...  1951-01-01T00:00:00.000
2                          NaN  ...  1952-01-01T00:00:00.000
3                          NaN  ...  1976-01-01T00:00:00.000
4                          NaN  ...  1902-01-01T00:00:00.000

[5 rows x 12 columns]

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [0]:
# your code here
pd.value_counts('nasa')

nasa    4
dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [0]:
# your code here
data.sample(nasa).to_json('data/nasa-output.json', orient='records')

## Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [0]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [0]:
# your code here
shuttle = pd.read_csv(tst_url, sep=' ', names=cols)

    time  rad_flow  fpv_close  fpv_open  ...  bypass  bpv_close  bpv_open  class
55     0        81          0        -6  ...      25         88        64      4
56     0        96          0        52  ...      40         44         4      4
50    -1        89         -7        50  ...      39         40         2      1
53     9        79          0        42  ...      25         37        12      4
55     2        82          0        54  ...      26         28         2      1
..   ...       ...        ...       ...  ...     ...        ...       ...    ...
80     0        84          0       -36  ...       4        120       116      5
55     0        81          0       -20  ...      26        102        76      4
55     0        77          0        12  ...      22         65        42      4
37     0       103          0        18  ...      66         85        20      1
56     2        98          0        52  ...      42         46         4      4

[14500 rows x 9 columns]

Let's verify that this worked by looking at the `head()` function.

In [0]:
# your code here
shuttle.head()

    time  rad_flow  fpv_close  fpv_open  ...  bypass  bpv_close  bpv_open  class
55     0        81          0        -6  ...      25         88        64      4
56     0        96          0        52  ...      40         44         4      4
50    -1        89         -7        50  ...      39         40         2      1
53     9        79          0        42  ...      25         37        12      4
55     2        82          0        54  ...      26         28         2      1

[5 rows x 9 columns]

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [0]:
# your code here
data.sample(shuttle).to_csv('data/shuttle.csv', sep = ',')

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [0]:
# your code here
astronauts = pd.read_excel('/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [0]:
# your code here

astronauts.head()

               Name    Year  ...  Death Date Death Mission
0   Joseph M. Acaba  2004.0  ...         NaT           NaN
1    Loren W. Acton     NaN  ...         NaT           NaN
2  James C. Adamson  1984.0  ...         NaT           NaN
3   Thomas D. Akers  1987.0  ...         NaT           NaN
4       Buzz Aldrin  1963.0  ...         NaT           NaN

[5 rows x 19 columns]

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [0]:
# your code here
pd.value_counts('astronauts')

astronauts    10
dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [0]:
# your code here
data.sample(astronauts).to_csv('data/astronaut.csv', sep=' ', index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [0]:
# your code here